; Magyar nyelvi fájl v3.7.6
; Fordító: gidano | sympda.blog.hu
; A kódlap kulcsban meg kell adni az adott nyelv kódlapszámát (pl. 1251 az orosz, 1253 a görög, és így tovább)).
bat_lang=hu
codepage=1250
error=HIBA^!
startup_error1=A Batch ApkTool nem rendelkezik teljes hozzáféréssel a mappához, vagy a telepítési útvonal érvénytelen karaktereket tartalmaz
startup_error2=A Batch ApkTool nem rendelkezik jogosultsággal a mappa írásához
previous_java1=A Java telepítve
previous_java2=A Batch ApkTool csak Java 8 vagy újabb verzióval működik megfelelően
get_java=A legfrissebb Java itt: https://www.java.com/en/download/
java_notfound=Nem található Java
ON=IGEN
OFF=NEM
MANUAL=MANUÁLIS
project=Jelenlegi projekt                           
currentapk=Kiválasztott APK                            
currentjar=Kiválasztott JAR                            
apilevel=API szint                                 
keepbroken=megtartja a törött erőforrásokat          
buildexpert=építés SZAKÉRTŐ módban                                               
dontwritedebug=Ne írja ki a debug infót smali-ba           
signafter=Kész APK fájlok aláírása                    
key=kulcs aláíráshoz                          
openlog=Napló megnyitás                                                       
language=Nyelv                                       
deodexall=Összes APK és JAR deodexálása               
copy_deodexed_apk=Deodexelt APK-k másolása ide, _INPUT_APK    
copy_deodexed_jar=Deodexelt JAR-ok másolása ide, _INPUT_JAR   
baksmaliapk=APK dekompilálása (csak smali)  
smaliapk=APK dekompilálása   
baksmalijar=JAR dekompilálása (csak smali)   
smalijar=JAR újrafordítása   
decompile=APK dekompilálása                           
decompile_r=APK dekompilálása (csak resources)          
recompile=APK újrafordítása                           
signfiles=Fájlok aláírása
zipalfiles=Fájlok zipalignálása
viewsource=Java forráskód megtekintés
plugins=Plug-inek >
selplugin=PLUG-IN KIVÁLASZTÁS:
adbmenu=ADB:
devices=eszközök                                    
install=telepít >                                   
rootremount=root, újracsatolás                          
pull=lement >                                    
push=feltölt >                                   
screenshot=képernyőkép                                 
screenrecord=képernyőfelvétel
shell=parancssori ablak
logs=naplók >
reboot=újraindít >
info=infó
kill-server=szerver kilövés
servicemenu=SZOLGÁLTATÁSOK:
cleanup1=Kitakarítás _framework, _system             
cleanup2=Kitakarítás _INPUT_APK, _INPUT_JAR          
cleanup3=Kitakarítás _OUT_APK, _OUT_JAR  
cleanup4=Kitakarítás ÖSSZ. mappa
exitmenu=KILÉP
choosetask=VÁLASSZ FELADATOT:
instframe=Framework telepítés
instframe_error=Framework telepítési hiba
inputapk_empty=Dekompiláláshoz helyezz fájlokat az _INPUT_APK mappába. Részletekhez olvasd el: readme.txt.
decompiling=Dekompilálás
decompiling_error=Dekompilálási hiba
recompiling=Újrafordítás
recompiling_error=Újrafordítási hiba
orignotfound=Hiba. Nem található az eredeti fájl.
backupnotfound=Hiba. _backup mappa nem található.
done=KÉSZ
signing=Aláírás
signing_error=Aláírási hiba
doneerrors=KÉSZ, de van ^!error_count^! HIBA.
zipal=Zipalignálás
zipal_error=Zipalignálási hiba
selectviewer=Válaszd ki a Java forráskód megtekintőt:
cancel=MÉGSE
makechoice=Kérlek válassz:
dragajd=húzd ide az APK, JAR vagy DEX fájlt:
genjava=Java kód generálás ebből
genjava_error=Java kód generálási hiba
apilevel_log=API szint                   
buildexpert_log=Építés SZAKÉRTŐ módban        
signafter_log=Kész APK-k aláírása            
press1=ENTER a folytatáshoz vagy 1 a napló megnyitásához:
deletedialog=Minden fájl törlése a következő mappákban:
proceed=Folytatod?
yes=IGEN
selproj=VÁLASSZ PROJEKTET:
createnewproj=Új projekt létrehozása
usedefproj=Alapért. projekt használata
inputprojname=Add meg a projekt nevét:
selectapk=APK KIVÁLASZTÁS:
allapks=Össz. APK itt: _INPUT_APK
selectjar=JAR KIVÁLASZTÁS:
alljars=Össz. JAR itt: _INPUT_JAR
selectapktool=APKTOOL KIVÁLASZTÁS:
selectsmali=SMALI KIVÁLASZTÁS:
aversions=Android verzió
apilevels=API szint      
enterapi=API szint kiválasztás:
invalidapi=Érvénytelen API szint^!
selectkey=KEY KIVÁLASZTÁS:
selectlang=NYELV KIVÁLASZTÁS:
framework_empty=Helyezz minden framework fájlt a _system\framework mappába. Részletekhez olvasd el: readme.txt.
deodexing=Deodexelés
notodexed=A fájl nem odexelt.
smerror=Smaling hiba
bsmerror=Baksmaling hiba
bootnotfound=A boot.oat nem található
selectarch=VÁLASSZ boot.oat ARCHITEKTÚRÁT:
selectedarch=Architektúra
extractboot=boot.oat kicsomagolás és deodexelés...
extractboot_error=boot.oat kicsomagolási hiba
errorunp=Kicsomagolási hiba
deodexing_error=Deodexelési hiba
baksmaling=Baksmaling
smaling=Smaling
connection_type=Kapcsolat típus:
input_ip=Add meg az eszköz IP címét, pl. 192.168.1.3:
input_ip2=Add meg az eszköz IP címét vagy ENTER a legutóbbi IP használatához
installtodef=Telepítés az alapértelmezett helyre:
singlefile=Egyetlen fájl
allfrom=Minden fájl itt
installtosd=Telepítés az SD-re:
dragtoinstall=Húzd ide az APK-t a telepítéshez:
installing=Telepítés
pull2=Lement:
pushto=Feltölt ide
dragtopush=Húzd a fájlt ide a feltöltéshez:
screensavedto=A képernyőkép fájlba mentve
closetostop=A felvétel leállításához zárd be ezt az ablakot
scrrecsavedto=A képernyő felvétel fájlba mentve
logcatr=radio
logcate=events
toscreen=megjelenít és mentés fájlba
tofile=Mentés fájlba
bugreport=Hibajelentés:
inlinetable=Inline módszer tábla:
saved_to_file=Napló fájlba mentve
android_version=Android verzió:
brand=Gyártó:
model=Modell:
reboot2=Újraindít:
reboot3=Újraindít
rebootto=Újraindít ...
symlinks=SYMLINKEK
copied_files=Másolt fájlok:
old_smali_used=Deodexeléshez válassz smali 2.2 vagy magasabbat
already_deodexed=A fájl már deodexelt.
onefrom=Egy fájl innen
alt_method=Alternatív módszer
tool_for_deodex=Deodexelő eszköz Android 6.x-7.x                                      
del_symlinks=Symlinkek törlése deodex után                                         
rewrite_opt=Mappa felülírási figyelmeztetés dekompilálás előtt                    
warn_rewrite1=Dekompilált alkalmazást tartalmazó mappa észlelve
warn_rewrite2=1 kiválasztására mappa felülírás, vagy ENTER a megszakításhoz
sound_opt=Értesítések hangja                                                    
manifest_opt=Eredeti AndroidManifest.xml mentése                                   
AUTO=AUTO
AUTO+=AUTO+
necessary_files_missing=A Batch ApkTool további működése nem lehetséges, mert egy vagy több szükséges fájl hiányzik
dex_notfound=A fájl nem tartalmaz classes.dex-et, a dekompilálás előtt deodexáltnak kell lennie.
elapsed_time=Eltelt idő
elapsed_h=ó.
elapsed_m=perc.
elapsed_s=mp.
tool_for_deodex_vdex=Eszköz Android 8.x deodexeléshez                                      
device_warning=Az Android 9.x deodexeléshez csatlakoztatni kell egy eszközt/emulátort ADB-n keresztül. Csatlakoztasd ([10] menüpont ) és indítsd újra a deodexelést.
signing_scheme_opt=APK aláírási séma                                                     